# <center> PROJECT PRACTICES</center>

<center>  
 DATA ANALSIS AND DATA CLEANING <br>
 HAIDER NASIR <br>
 haidernasir57@gmail.com<br>

 
 [GitHub:haidernasirr](https://github.com/haidernasirr)


 </center>

## Step1:install libraries

In [ ]:
%pip install pandas
%pip install numpy

Requirement already satisfied: pandas in c:\users\haider\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\haider\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\haider\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\haider\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\haider\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\haider\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: numpy in c:\users\haider\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

## Step2:import libraries

In [2]:
import pandas as pd
import numpy as np

## Step 3: Load the CSV data into a DataFrame

In [3]:
df=pd.read_csv('data.csv')

In [4]:
df

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

## Step 4:check missing values

In [8]:
print(df.isnull().sum())

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

## Step 5:fill missing values in the salary and age column with the mean or median salary/age

In [12]:
mean_salary=df['Salary'].mean()
df['Salary'].fillna(mean_salary,inplace=True)

C:\Users\HAIDER\AppData\Local\Temp\ipykernel_9612\1913911236.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mean_salary,inplace=True)

In [13]:
print(df.isnull().sum())

Name           0
Designation    0
Gender         0
Age            1
Salary         0
dtype: int64

### by median

In [16]:

df2=df['Salary'].fillna(df['Salary'].median())
print(df2)

0     1.150000e+05
1     3.500000e+04
2     5.000000e+04
3     7.000000e+04
4     1.500000e+06
5     1.725333e+05
6     2.000000e+04
7     1.150000e+05
8     3.500000e+04
9     1.725333e+05
10    7.000000e+04
11    9.000000e+04
12    1.100000e+05
13    2.000000e+03
14    1.600000e+04
15    1.700000e+05
16    1.900000e+05
Name: Salary, dtype: float64

In [23]:
df2=df['Age'].fillna(df['Age'].median())
print(df2)

0      37.0000
1      30.0000
2      29.0000
3      30.0000
4      25.0000
5      22.0000
6      29.0000
7      26.0000
8      28.0000
9      55.0000
10     60.0000
11     48.6875
12    156.0000
13     67.0000
14     80.0000
15     20.0000
16     85.0000
Name: Age, dtype: float64

In [17]:
mean_Age=df['Age'].mean()
df['Age'].fillna(mean_Age,inplace=True)

C:\Users\HAIDER\AppData\Local\Temp\ipykernel_9612\2112120562.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_Age,inplace=True)

In [18]:
print(df.isnull().sum())

Name           0
Designation    0
Gender         0
Age            0
Salary         0
dtype: int64

In [25]:
df

             Name Designation Gender       Age        Salary
0         Mukhtar   Professor      M   37.0000  1.150000e+05
1           Azziz     Teacher      M   30.0000  3.500000e+04
2          Mohsin    Engineer      M   29.0000  5.000000e+04
3   Naveed Fatima     Analyst      F   30.0000  7.000000e+04
4           Babar    Engineer      F   25.0000  1.500000e+06
5            Aqsa   Scientist      F   22.0000  1.725333e+05
6           Rafia     Analyst      F   29.0000  2.000000e+04
7           Samra   Scientist      F   26.0000  1.150000e+05
8            Eman    Engineer      F   28.0000  3.500000e+04
9        Abdullah     Teacher      M   55.0000  1.725333e+05
10          Mosib   professor      M   60.0000  7.000000e+04
11          Ahmed    engineer      M   48.6875  9.000000e+04
12          Ahsan     trainer      M  156.0000  1.100000e+05
13          Wajid     teacher      M   67.0000  2.000000e+03
14          Naeem     trainer      M   80.0000  1.600000e+04
15         Qaisar   professor      M   20.0000  1.700000e+05
16          Wajid    Engineer      M   85.0000  1.900000e+05

## Step6:correct any obvious data entry errors in  the 'Age' column

In [22]:
df['Age'].apply(lambda x:x if x<120 else mean_Age)

0     37.0000
1     30.0000
2     29.0000
3     30.0000
4     25.0000
5     22.0000
6     29.0000
7     26.0000
8     28.0000
9     55.0000
10    60.0000
11    48.6875
12    48.6875
13    67.0000
14    80.0000
15    20.0000
16    85.0000
Name: Age, dtype: float64

## median

In [24]:
df['Age'].apply(lambda x:x if x<120 else df2)

0                                                  37.0
1                                                  30.0
2                                                  29.0
3                                                  30.0
4                                                  25.0
5                                                  22.0
6                                                  29.0
7                                                  26.0
8                                                  28.0
9                                                  55.0
10                                                 60.0
11                                              48.6875
12    0      37.0000
1      30.0000
2      29.0000
3...
13                                                 67.0
14                                                 80.0
15                                                 20.0
16                                                 85.0
Name: Age, dtype: object

## Step7: calculate the average salary by gender

In [28]:
salary_by_gender=df.groupby('Gender')['Salary'].mean()
print(salary_by_gender)

Gender
F    318755.555556
M     92775.757576
Name: Salary, dtype: float64

BY AGE

In [29]:
salary_by_Age=df.groupby('Age')['Salary'].mean()
print(salary_by_Age)

Age
20.0000     1.700000e+05
22.0000     1.725333e+05
25.0000     1.500000e+06
26.0000     1.150000e+05
28.0000     3.500000e+04
29.0000     3.500000e+04
30.0000     5.250000e+04
37.0000     1.150000e+05
48.6875     9.000000e+04
55.0000     1.725333e+05
60.0000     7.000000e+04
67.0000     2.000000e+03
80.0000     1.600000e+04
85.0000     1.900000e+05
156.0000    1.100000e+05
Name: Salary, dtype: float64

In [31]:
df

             Name Designation Gender       Age        Salary
0         Mukhtar   Professor      M   37.0000  1.150000e+05
1           Azziz     Teacher      M   30.0000  3.500000e+04
2          Mohsin    Engineer      M   29.0000  5.000000e+04
3   Naveed Fatima     Analyst      F   30.0000  7.000000e+04
4           Babar    Engineer      F   25.0000  1.500000e+06
5            Aqsa   Scientist      F   22.0000  1.725333e+05
6           Rafia     Analyst      F   29.0000  2.000000e+04
7           Samra   Scientist      F   26.0000  1.150000e+05
8            Eman    Engineer      F   28.0000  3.500000e+04
9        Abdullah     Teacher      M   55.0000  1.725333e+05
10          Mosib   professor      M   60.0000  7.000000e+04
11          Ahmed    engineer      M   48.6875  9.000000e+04
12          Ahsan     trainer      M  156.0000  1.100000e+05
13          Wajid     teacher      M   67.0000  2.000000e+03
14          Naeem     trainer      M   80.0000  1.600000e+04
15         Qaisar   professor      M   20.0000  1.700000e+05
16          Wajid    Engineer      M   85.0000  1.900000e+05

 by designation

In [32]:
salary_by_designation=df.groupby('Designation')['Salary'].mean()
print(salary_by_designation)

Designation
Analyst       45000.000000
Engineer     443750.000000
Professor    115000.000000
Scientist    143766.666667
Teacher      103766.666667
engineer      90000.000000
professor    120000.000000
teacher        2000.000000
trainer       63000.000000
Name: Salary, dtype: float64

In [35]:
Designation_by_age=df.groupby('Designation')['Age'].mean()
print(Designation_by_age)

Designation
Analyst       29.5000
Engineer      41.7500
Professor     37.0000
Scientist     24.0000
Teacher       42.5000
engineer      48.6875
professor     40.0000
teacher       67.0000
trainer      118.0000
Name: Age, dtype: float64

## Step8:filter rows where salary is greater than 100000

In [36]:
high_salary_df=df[df['Salary']>100000]
print(high_salary_df)

        Name Designation Gender    Age        Salary
0    Mukhtar   Professor      M   37.0  1.150000e+05
4      Babar    Engineer      F   25.0  1.500000e+06
5       Aqsa   Scientist      F   22.0  1.725333e+05
7      Samra   Scientist      F   26.0  1.150000e+05
9   Abdullah     Teacher      M   55.0  1.725333e+05
12     Ahsan     trainer      M  156.0  1.100000e+05
15    Qaisar   professor      M   20.0  1.700000e+05
16     Wajid    Engineer      M   85.0  1.900000e+05

## Step 9: sort by age

In [37]:
sorted_df=df.sort_values(by='Age',ascending=False)
print(sorted_df)

             Name Designation Gender       Age        Salary
12          Ahsan     trainer      M  156.0000  1.100000e+05
16          Wajid    Engineer      M   85.0000  1.900000e+05
14          Naeem     trainer      M   80.0000  1.600000e+04
13          Wajid     teacher      M   67.0000  2.000000e+03
10          Mosib   professor      M   60.0000  7.000000e+04
9        Abdullah     Teacher      M   55.0000  1.725333e+05
11          Ahmed    engineer      M   48.6875  9.000000e+04
0         Mukhtar   Professor      M   37.0000  1.150000e+05
1           Azziz     Teacher      M   30.0000  3.500000e+04
3   Naveed Fatima     Analyst      F   30.0000  7.000000e+04
2          Mohsin    Engineer      M   29.0000  5.000000e+04
6           Rafia     Analyst      F   29.0000  2.000000e+04
8            Eman    Engineer      F   28.0000  3.500000e+04
7           Samra   Scientist      F   26.0000  1.150000e+05
4           Babar    Engineer      F   25.0000  1.500000e+06
5            Aqsa   Scientist      F   22.0000  1.725333e+05
15         Qaisar   professor      M   20.0000  1.700000e+05

In [38]:
sorted_df=df.sort_values(by='Age',ascending=True)
print(sorted_df)

             Name Designation Gender       Age        Salary
15         Qaisar   professor      M   20.0000  1.700000e+05
5            Aqsa   Scientist      F   22.0000  1.725333e+05
4           Babar    Engineer      F   25.0000  1.500000e+06
7           Samra   Scientist      F   26.0000  1.150000e+05
8            Eman    Engineer      F   28.0000  3.500000e+04
2          Mohsin    Engineer      M   29.0000  5.000000e+04
6           Rafia     Analyst      F   29.0000  2.000000e+04
1           Azziz     Teacher      M   30.0000  3.500000e+04
3   Naveed Fatima     Analyst      F   30.0000  7.000000e+04
0         Mukhtar   Professor      M   37.0000  1.150000e+05
11          Ahmed    engineer      M   48.6875  9.000000e+04
9        Abdullah     Teacher      M   55.0000  1.725333e+05
10          Mosib   professor      M   60.0000  7.000000e+04
13          Wajid     teacher      M   67.0000  2.000000e+03
14          Naeem     trainer      M   80.0000  1.600000e+04
16          Wajid    Engineer      M   85.0000  1.900000e+05
12          Ahsan     trainer      M  156.0000  1.100000e+05

## saving cleaned data as new csv

In [42]:
df.to_csv('cleaned_data.csv',index=False)

In [43]:
print(df.describe())

             Age        Salary
count   17.00000  1.700000e+01
mean    48.68750  1.725333e+05
std     34.43058  3.473600e+05
min     20.00000  2.000000e+03
25%     28.00000  3.500000e+04
50%     30.00000  9.000000e+04
75%     60.00000  1.700000e+05
max    156.00000  1.500000e+06

In [44]:
df

             Name Designation Gender       Age        Salary
0         Mukhtar   Professor      M   37.0000  1.150000e+05
1           Azziz     Teacher      M   30.0000  3.500000e+04
2          Mohsin    Engineer      M   29.0000  5.000000e+04
3   Naveed Fatima     Analyst      F   30.0000  7.000000e+04
4           Babar    Engineer      F   25.0000  1.500000e+06
5            Aqsa   Scientist      F   22.0000  1.725333e+05
6           Rafia     Analyst      F   29.0000  2.000000e+04
7           Samra   Scientist      F   26.0000  1.150000e+05
8            Eman    Engineer      F   28.0000  3.500000e+04
9        Abdullah     Teacher      M   55.0000  1.725333e+05
10          Mosib   professor      M   60.0000  7.000000e+04
11          Ahmed    engineer      M   48.6875  9.000000e+04
12          Ahsan     trainer      M  156.0000  1.100000e+05
13          Wajid     teacher      M   67.0000  2.000000e+03
14          Naeem     trainer      M   80.0000  1.600000e+04
15         Qaisar   professor      M   20.0000  1.700000e+05
16          Wajid    Engineer      M   85.0000  1.900000e+05